server/app/controllers/users_controller.rb

    def create
        if email_exists?
            render status: 409,
                json: { response: "User already registered with email #{user_params[:email]}.\r\nPlease register with a different email." }
            return
        end

        @user = User.new(user_params)
        @user.save

        if doorkeeper_oauth_client and @user
            @access_token ||= Doorkeeper::AccessToken.create!(application_id: DOORKEEPER_APP_ID, resource_owner_id: @user.id, scopes: "public write preferences", use_refresh_token: true, expires_in: Doorkeeper.configuration.access_token_expires_in)
---
INSERT INTO "users" ("email", "encrypted_password", "first_name", "last_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "hikarij@gmail.com"], ["encrypted_password", "$2a$10$tenqcUKkO/wpp5hxtNkmdO8SgCIpkQ7cdVSZS9Jw.id8E98qv35bi"], ["first_name", "Hikari"], ["last_name", "Perlman"]]
INSERT INTO "oauth_access_tokens" ("application_id", "created_at", "expires_in", "refresh_token", "resource_owner_id", "scopes", "token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def email_exists?
        @user = User.find_by_email(params[:email].downcase)
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'HikariJ@gmail.com' LIMIT 1