server/app/controllers/api/v1/compose_controller.rb

INSERT INTO "messages" ("body", "created_at", "display_id", "from", "is_read", "subject", "to", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "message_categories" ("created_at", "message_id", "message_type_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-09-26 12:09:13.551722"], ["message_id", 2], ["message_type_id", 2], ["updated_at", "2016-09-26 12:09:13.551722"]]
---
    def create
        user = current_user
        if user.present?
            message = user.messages.sent.new(compose_params)
            message.is_read = true
            message.save

            sentCategory = message.message_categories.build
            sentCategory.message_type = MessageType.sent.first
            sentCategory.save