server/app/controllers/api/v1/emails_controller.rb

    def inbox
        @user = User.first
---
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1