server/app/controllers/api/v1/inbox_controller.rb

UPDATE "messages" SET "is_read" = $1, "updated_at" = $2 WHERE "messages"."id" = 1  [["is_read", "t"], ["updated_at", "2016-09-24 16:21:10.955612"]]
---
    def create
        user = current_user
        if user.present?
            message = user.messages.inbox.where(display_id: inbox_params[:id]).first
            if message.present?
                message.is_read = inbox_params[:is_read]
                message.save