server/app/controllers/api/v1/sent_controller.rb

    def create
        user = current_user
        if user.present?
            message = user.messages.sent.where(display_id: sent_params[:id]).first
            if message.present?
                message.is_read = sent_params[:is_read]
                message.save
---
UPDATE "messages" SET "is_read" = $1, "updated_at" = $2 WHERE "messages"."id" = 2  [["is_read", "t"], ["updated_at", "2016-09-26 12:10:34.609862"]]

    def destroy
        user = current_user
        if user.present?
            message = user.messages.sent.where(display_id: sent_params[:id]).first
            message.destroy if message.present?
---
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 2]]